# ... existing imports ...
from time import sleep
from lib.PCANBasic import *  # PCAN-Basic library import
import asyncio
# PCAN初始化
objPCANBasic = PCANBasic()
PcanHandle = PCAN_USBBUS1
result = objPCANBasic.Initialize(PcanHandle, PCAN_BAUD_1M)
if result != PCAN_ERROR_OK:
    print(f"Failed to initialize the PCAN device: {result}")
    exit(1)

# 定义速度二维数组 ActionTab1
ActionTab1 = [
    [1000,1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000,1000],  # 0
    [500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500,500],  # 1
    [1000,1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000,1000],  # 2
    [500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500,500],  # 3
    [1000,1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000,1000],  #  4
    [500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500,500],  #  5
    [2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000,2000],  #  6
    [2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000,2000],  # 7
    [1000,1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000,1000],   #  8
    [500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500,500],  #  9
    [1000,1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000,1000],  # 0
    [500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500,500],  # 1
]

# # # 定义二维数组 ActionTab26
# ActionTab2 = [
#     [0,0,1766,1514,0,1910,593,0,2224,0,184,2062,0,603,1600,3793],  # 抓网球张开 0
#     [1898,1898, 1766,4095,1435,1910,2084,1818,2224,1381,1749,2062,2091,3297,1600,3793 ],  # 抓网球抓紧 1
#     [1567,1567,1862,10,0,1905,20, 0,2219,10,0,2057,0,0,1595,3547],  #鸡蛋打开 2
#     [2161,2161,1862,1685,1665,1168,979,939,1834,1277,1257,1097,0,0,1595,3547],  #鸡蛋抓取 3
#     [0,0,1033,1514,0,1442,593,0,2260,0,184,1696,0,603,1363,3793],  #拉布布打开  4
#     [1898,1898,1766,4095,1435,1910,2084,1818,2224,1381,1749,2062,2091,3297,1600,3793],   #拉布布抓取  5  
#     [0,0,0,0, 0, 0 ,0,0, 0 ,0,0,0,0,0,0,3378],  #sj抓取 6 
#     [3362,3362, 0,3121,3121,0,3043,3043,0,2928,2928,0,4095,4095,0,3378],  #sj打开 7  
#     [1527,1527,2258,775,775,2255,1166,1166,2137,1694,1694,1625,959,959,1961,3428],  #jn打开 8   
#     [1933,1933,2194,780,780,2260,1482,1482,1952,1698,1698,1630,964,964,1965,3428],  #jn抓取 9 
#     [0,0,1766,1514,0,1910,593,0,2224,0,184,2062,0,603,1600,3793],  # z抓可乐 10
#     [1898,1898, 1766,4095,1435,1910,2084,1818,2224,1381,1749,2062,2091,3297,1600,3793 ],  # 抓网球抓紧 11
#     ]
# # 定义二维数组 ActionTab26
ActionTab2 = [
    [0,0,1766,1514,0,1910,593,0,2224,0,184,2062,0,603,1600,3793],  # 抓网球张开 0
    [1898,1898, 1766,4095,1435,1910,2084,1818,2224,1381,1749,2062,2091,3297,1600,3793 ],  # 抓网球抓紧 1
    # [1567,1567,1862,10,0,1905,20, 0,2219,10,0,2057,0,0,1595,3547],  #鸡蛋打开 2
    [1567,1567,2250,10,0,1905,20, 0,2219,10,0,2057,0,0,1595,3547],  #鸡蛋打开 2
    [2161,2161,2050,1685,1665,1168,979,939,1834,1277,1257,1097,0,0,1595,3547],  #鸡蛋抓取 3
    [0,0,1033,1514,0,1442,593,0,2260,0,184,1696,0,603,1363,3793],  #拉布布打开  4
    [1898,1898,1766,4095,1435,1910,2084,1818,2224,1381,1749,2062,2091,3297,1600,3793],   #拉布布抓取  5  
    [0,0,0,0, 0, 0 ,0,0, 0 ,0,0,0,0,0,0,3378],  #sj打开 6 
    [2144 ,   2144   , 1472   , 3112  ,  3112    ,   0   , 3029  ,  3029  ,     0  ,  2915  ,  2915   ,    0  ,  4067  ,  4067  ,     0  ,  3328  ],  #sj抓取 7  
    # [1527,1527,2258,775,775,2255,1166,1166,2137,1694,1694,1625,959,959,1961,3428],  #jn打开 8   
    # [1933,1933,2194,780,780,2260,1482,1482,1952,1698,1698,1630,964,964,1965,3428],  #jn抓取 9 
    [1527,1527,2258,775,775,2255,1166,1166,1990,1694,1694,1625,959,959,1961,3428],  #jn打开 8   
    [1933,1933,2194,780,780,2260,1482,1482,1900,1698,1698,1630,964,964,1965,3428],  #jn抓取 9 
    [0,0,1766,1514,0,1910,593,0,2224,0,184,2062,0,603,1600,3793],  # z抓可乐 10
    [1898,1898, 1766,4095,1435,1910,2084,1818,2224,1381,1749,2062,2091,3297,1600,3793 ],  # 抓网球抓紧 11
    ]

ActionTab3 = [
    [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100,100],  #  0
    [50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50,50],  #  1
    [200, 200, 250, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200,200],   #  2
    [20, 20, 20, 20, 20,20, 20, 20, 20, 20, 20, 20, 20, 20, 20,20], # 3
    [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100,100],  #  4
    [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100,100],   #  5
    [200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200,200],   #  6
    [200, 200, 200, 200, 200, 200, 200, 200, 200,200, 200, 200, 200, 200, 200,200],  #  7
    [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100,100],  #  8
    [20, 20, 20, 20, 20,20, 20, 20, 20, 20, 20, 20, 20, 20, 20,20],  #  9
    [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100,100],  #  0
    [100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100,100],  #  0
    ]


# 发送CAN消息的函数
def send_can_message(motor_id, data):
    pcan_msg = TPCANMsg()
    pcan_msg.ID = motor_id
    pcan_msg.MSGTYPE = PCAN_MESSAGE_STANDARD
    pcan_msg.LEN = len(data)
    for i in range(len(data)):
        pcan_msg.DATA[i] = data[i]

    result = objPCANBasic.Write(PcanHandle, pcan_msg)
    if result != PCAN_ERROR_OK:
        print(f"Failed to send message: {result}")

# 封装发送预定义动作的函数
def send_predefined_action1(action_index):
    """
    发送预定义的动作数据到15个电机
    :param action_index: 动作编号 (0-3)
    """
    if action_index < 0 or action_index >= len(ActionTab2):
        print("错误：无效的动作编号")
        return

    # 获取对应的速度数据和位置数据
    speed_data = ActionTab1[action_index]
    position_data = ActionTab2[action_index]
    dianliu_data = ActionTab3[action_index]


    for i in range(16):
        motor_id = i + 1  # 电机ID从1到15
        speed = speed_data[i]  # 获取电机速度
        position = position_data[i]  # 获取电机位置
        dianliu = dianliu_data[i]
        # 构造CAN消息数据：0xA1是命令，后跟位置（低字节，高字节）和速度（低字节，高字节）
        data = [
            0xAA,  # 命令
            position & 0xFF, (position >> 8) & 0xFF,  # 位置（低字节，高字节）
            speed & 0xFF, (speed >> 8) & 0xFF,  # 速度（低字节，高字节）
            dianliu & 0xFF,(dianliu >>8) & 0xFF

        ]
        send_can_message(motor_id, data)
        # print(f"发送到电机 {motor_id}: 速度={speed}, 位置={position}, 数据={data}")
        sleep(0.001)

# 封装发送预定义动作的函数
async def send_predefined_action(action_index):
    """
    发送预定义的动作数据到15个电机
    :param action_index: 动作编号 (0-3)
    """
    if action_index < 0 or action_index >= len(ActionTab2):
        print("错误：无效的动作编号")
        return

    # 获取对应的速度数据和位置数据
    speed_data = ActionTab1[action_index]
    position_data = ActionTab2[action_index]
    dianliu_data = ActionTab3[action_index]


    for i in range(16):
        motor_id = i + 1  # 电机ID从1到15
        speed = speed_data[i]  # 获取电机速度
        position = position_data[i]  # 获取电机位置
        dianliu = dianliu_data[i]
        # 构造CAN消息数据：0xA1是命令，后跟位置（低字节，高字节）和速度（低字节，高字节）
        data = [
            0xAA,  # 命令
            position & 0xFF, (position >> 8) & 0xFF,  # 位置（低字节，高字节）
            speed & 0xFF, (speed >> 8) & 0xFF,  # 速度（低字节，高字节）
            dianliu & 0xFF,(dianliu >>8) & 0xFF

        ]
        send_can_message(motor_id, data)
        # print(f"发送到电机 {motor_id}: 速度={speed}, 位置={position}, 数据={data}")
        await asyncio.sleep(0.001)

 # 封装发送预定义动作的函数
async def send_clean():
    """
    发送预定义的动作数据到15个电机
    :param action_index: 动作编号 (0-100)
    """


    for i in range(16):
        motor_id = i + 1  # 电机ID从1到15
        data = [
            0xA5,  # 命令

        ]
        send_can_message(motor_id, data)
        await asyncio.sleep(0.001)
# 异步主循环
async def main():
    while True:
        try:
            # 获取用户输入
            action_index = int(input("请输入动作编号 (0-100): "))
            # 调用发送预定义动作的函数
            await send_clean()
            await send_predefined_action(action_index)
            

        except ValueError:
            print("请输入有效的数字")
        except KeyboardInterrupt:
            break

    # 关闭PCAN设备
    objPCANBasic.Uninitialize(PcanHandle)
    print("设备关闭")

# 运行异步主循环
if __name__ == '__main__':
    asyncio.run(main())